tap "antoniorodr/memo"
tap "brian/old-tap"
tap "discoteq/discoteq"
tap "osx-cross/arm"
tap "px4/px4"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "llvm"
brew "bear"
brew "boost"
brew "clang-format"
brew "coreutils"
brew "dvc"
brew "eigen"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "graphviz"
brew "helix"
brew "ncurses"
brew "neovim"
brew "openai-whisper"
brew "pipx"
brew "python-tk@3.13"
brew "python@3.12"
brew "tailscale"
brew "tinyxml"
brew "uv"
brew "antoniorodr/memo/memo"
brew "px4/px4/gcc-arm-none-eabi"
brew "px4/px4/px4-dev"
brew "steipete/tap/bird"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "yakitrak/yakitrak/obsidian-cli"
cask "codex"
cask "ghostty"
cask "mactex"
vscode "anysphere.cpptools"
vscode "anysphere.cursorpyright"
vscode "asvetliakov.vscode-neovim"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "vadimcn.vscode-lldb"
